use lab_5;


SELECT Товар,
    Цена_продажи,
    SUM(Количество_заказанного_товара) as Общее_количество_заказанного_товара
FROM ЗАКАЗЫ
WHERE Товар IN ('Молоко', 'Чай')
GROUP BY Товар,Цена_продажи;


-- ROLLUP--

SELECT Товар,
    Цена_продажи,
    SUM(Количество_заказанного_товара) as Общее_количество_заказанного_товара
FROM ЗАКАЗЫ
WHERE Товар IN ('Молоко', 'Чай')
GROUP BY ROLLUP(Товар,Цена_продажи)


-- CUBE --

SELECT Товар, Цена_продажи,
    SUM(Количество_заказанного_товара) as Общее_количество_заказанного_товара
FROM ЗАКАЗЫ
WHERE Товар IN ('Молоко', 'Чай')
GROUP BY CUBE(Товар,Цена_продажи)


-- UNION --
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент = '+37533380591'
    GROUP BY Товар
UNION
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN ('+37523213121', '+37533380591')
    GROUP BY Товар

--UNION ALL--
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент = '+37533380591'
    GROUP BY Товар
UNION ALL
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN ('+37523213121', '+37533380591')
    GROUP BY Товар

--INTERSECT-
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN('+37533380591', '+37523213121')
    GROUP BY Товар
INTERSECT
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN ('+37523213121','+37523213121')
    GROUP BY Товар

--EXCEPT--

    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN('+37533380591', '+37523213121')
    GROUP BY Товар
EXCEPT
    SELECT Товар,
        SUM(Количество_заказанного_товара) as Количество_заказанного_товара
    FROM ЗАКАЗЫ
    WHERE Телефон_клиент IN ('+37523213121')
    GROUP BY Товар











